readme.org
#+title: MTS SRE course - task 3 - Load Testing
#+AUTHOR: Maksim Fesenko (102)

* Задание
** Разработать профиль нагрузки для системы
*** Сценарий 1 - Получение текущей погоды
**** Описание: Пользователь запрашивает текущую погоду
**** Частота: 50 запросов в минуту
**** Данные: Запрос содержит параметр `city`

*** Cценарий 2 - Параллельные запросы

*** Сценарий 3 - Случайные запросы
**** Описание: Пользователи отправляют случайные запросы о текущей погоде в различных городах
**** Частота: 15 запросов в минуту
**** Данные: Случайные значения параметра `city`
*** Сценарий 4 - Тестирование ошибок
**** Описание: Пользователи отправляют запросы с неверными параметрами для проверки обработки ошибок
**** Частота: 10 запросов в минуту
**** Данные: Запросы содержат неверные значения параметра city или отсутстовать
*** Сценарий 5 - Постепенное увеличение нагрузки
**** Описание: Нагрузка постепенно увеличивается в течение определенного периода времени для проверки устойчивости
**** Частота: С 10 запросов в минуту до 100 запросов в секунду в течение 30 минут
** Реализовать профиль на любом инструменте НТ
** Задать нефункциональные требования по производительности (SLA/SLO)
- Процентиль времени отклика (95% запросов должны быть обработаны за Х миллисекунд)
- Пропускная способность (RPS)
- Время обработки запроса на сервере (максимальное/среднее)
** Максимальная производительность
** Вывод
